/*ZTzTopia*/
var Discord = require('discord.js');

module.exports.run = async (bot, msg, args) => {
const faces = [
    '(∩ ͠°ل͜ °)⊃━☆',
    '☞ ﾟ ͜ʖ ﾟ☞',
    'ᖗ ◉ ᨓ ◉ ᖘ',
    'ᕦ(ʘᴥʘ)ᕥ',
    '(づ◉ ͜ʖ◉)づ',
    '(づ>﹏<)づ',
    '(☉ ͜ʖ☉)',
    '(ง ò ʖ̯ ó )ง',
    'ʕ ◕ ͜ʖ ◕ ʔ',
    'ᕙ( ☉ Ꮂ ☉ )ᕗ',
    '( ͡° ͜ʖ ͡° )',
    '༼ つ ◕_◕ ༽つ',
    'ಠ_ಠ',
    '(ಥ﹏ಥ)',
    '┬─┬ノ( º _ ºノ)',
    '(▰˘◡˘▰)',
    '╚(ಠ_ಠ)=┐',
    '( ಠ ͜ʖರೃ)',
    '┬┴┬┴┤ ͜ʖ ͡°) ├┬┴┬┴',
    '( ͡°( ͡° ͜ʖ( ͡° ͜ʖ ͡°)ʖ ͡°) ͡°)',
    '(ง ﾟ ͜つ ﾟ)ง',
    '( ͡°O ͜ʖ ͡°O)',
    'ヽ༼ຈل͜ຈ༽ﾉ',
    '(͡◔ ͜ʖ ͡◔)',
    '( ͡ ͜ ʖ ͡ )',
    '( ͡°Ĺ̯ ͡° )',
    '( ͡~ ͜ʖ ͡~)',
    '( ͜。 ͡ʖ ͜。)',
    '( ° ͜ʖ͡°)╭∩╮',
    '( ͡~ ͜ʖ ͡°)',
    'ᕕ( ͡° ͜ʖ ͡°)ᕗ',
    '( ͡ _ ͡°)ﾉ⚲ ♫',
    '(╯ຈل͜ຈ) ╯︵ ┻━┻',
    '( ͡° ͜ʖ ͡°)=ε✄',
    '✺◟( ͡° ͜ʖ ͡°)◞✺',
    '(╯ ͝° ͜ʖ͡°)╯︵ ┻━┻',
    '┬━┬ノ(▀̿̿Ĺ̯̿̿▀̿ ̿ノ)',
    '━╤デ╦︻(▀̿̿Ĺ̯̿̿▀̿ ̿)',
    'ᕙ(░ಥ╭͜ʖ╮ಥ░)━☆ﾟ.*･｡ﾟ',
    '（╯°□°）╯︵ ( ͜。 ͡ʖ ͜。)',
    '(∩ ͡ ° ʖ ͡ °) ⊃-(===>',
    '︵‿︵(´ ͡༎ຶ ͜ʖ ͡༎ຶ `)︵‿︵',
    'ヽ༼ ຈل͜ຈ༼ ▀̿̿Ĺ̯̿̿▀̿ ̿༽Ɵ͆ل͜Ɵ͆ ༽ﾉ',
];
msg.channel.send(faces[Math.floor(Math.random() * faces.length)]);
}

module.exports.help = {
    name: "faces",
    type: "Emoji",
    description: 'Gives a random faces.',
    format: 'faces',
    require: "None."
}
